УчетВУправляющихДляГит1/src/Catalogs/ПравилаПредставленияОтчетовУплатыНалогов/ПравилаПредставленияОтчетовУплатыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаПредставленияОтчетовУплатыНалогов</name>
  <owners>Catalog.ЗадачиБухгалтера</owners>
  <attributes>
    <name>НачалоДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ВидыДействийКалендаряБухгалтера</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйПериод</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>24</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеренестиНаРабочийДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазовыйПериод</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтставаниеБазовогоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИнформацияНаИТС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйПервыйНалоговыйПериод</name>
    <type>
      <types>EnumRef.ВариантыРасширенногоПервогоНалоговогоПериода</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаОтчетаОграничена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Условия</name>
    <comment>объединяются по &quot;И&quot;</comment>
    <attributes>
      <name>Условие</name>
      <type>
        <types>EnumRef.УсловияПримененияТребованийЗаконодательства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/ВидыДействийКалендаряБухгалтера/ВидыДействийКалендаряБухгалтера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДействийКалендаряБухгалтера</name>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>УплатаНалога</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>РегулярныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/ПравилаПредставленияОтчетовУплатыНалогов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Устанавливает значение свойства ОтправкаОтчетаОграничена в соответствие с информацией о возможностях отправки.
// Следует вызвать до записи объекта.
// Не используется обработчик ПередЗаписью, потому что изменение справочника предполагается в обработчиках обновления,
// при этом запись выполняется в цикле и подлежащее установке значение свойства можно эффективно определить вне цикла.
//
// Параметры:
//  УстанавливаемоеЗначение	 - Булево - Истина, если отправка отчета ограничена.
//                           - Неопределено - процедура сама определит значение.
//
Процедура УстановитьОтправкаОтчетаОграничена(Знач УстанавливаемоеЗначение = Неопределено) Экспорт
	
	// Свойство применяется только для отчетов.
	// Чтобы не проверять это при использовании, сбросим его для не-отчетов.
	Если Действие <> Перечисления.ВидыДействийКалендаряБухгалтера.Отчет Тогда
		ОтправкаОтчетаОграничена = Ложь;
		Возврат;
	КонецЕсли;
	
	Если УстанавливаемоеЗначение = Неопределено Тогда
		
		КодЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Код");
		Если Не ЗначениеЗаполнено(КодЗадачи) Тогда
			УстанавливаемоеЗначение = Ложь;
		Иначе
			УстанавливаемоеЗначение = ВыполнениеЗадачБухгалтера.ОтправкаОтчетаОграничена(КодЗадачи, Код);
		КонецЕсли;
		
	КонецЕсли;
	
	ОтправкаОтчетаОграничена = УстанавливаемоеЗначение;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
